Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelUpdateDto.ModelName
Gets or sets the model name.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelUpdateDto.VersionId
Gets or sets the version of the model to the specified version identifier (rollback functionality).

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelUpdateDto.Tags
Gets or sets the list of tags for categorizing the model.
Should include all tags, not just the changes.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelUpdateDto.Metadata
Gets or sets the model metadata for storing additional information about the model.
Should include all metadata, not just the changes.